[
    {
      "date": "2026-01-10",
      "text": "This week we continued a systematic evaluation of a panel of antimicrobial peptides (AMPs) to assess their bactericidal activity against the selected target bacterial strains. Overnight cultures were grown in [specified growth medium, e.g. Mueller–Hinton broth or LB] at 37 °C with shaking at 200 rpm, then diluted 1:100 into fresh medium and grown to mid-logarithmic phase (OD₆₀₀ = 0.3 ± 0.02). Cultures were normalized to this optical density to ensure comparable starting cell densities across all experimental conditions. All peptide treatments were performed under aerobic conditions at 37 °C with continuous shaking to maintain homogeneous exposure. AMPs were reconstituted in sterile distilled water (or appropriate solvent, if applicable) and filter-sterilised prior to use. Working concentrations were freshly prepared immediately before each experiment to minimise peptide degradation or adsorption to plasticware. Untreated cultures and solvent-only controls were included in all experiments to control for baseline viability and any solvent-associated effects. Primary bactericidal activity was assessed by quantifying viable cells following short- and medium-duration peptide exposure using colony-forming unit (CFU) enumeration. For dose–response assays, four peptides (AMP-1 to AMP-4) were tested across a concentration range of 0.5–32 µM. Peptides were added directly to standardized cultures and incubated for 2 hours, after which samples were serially diluted in phosphate-buffered saline and plated on non-selective agar. Plates were incubated for 16–18 hours at 37 °C prior to colony counting. CFU values were expressed as CFU/mL and normalised to untreated controls. Each condition was performed with a minimum of three biological replicates, each plated in technical duplicate. These assays revealed that AMP-2 and AMP-4 consistently induced statistically significant reductions in viable cell counts relative to untreated controls (p < 0.05, one-way ANOVA with post-hoc testing). AMP-4 demonstrated the strongest activity, achieving near-complete killing at concentrations ≥16 µM. In contrast, AMP-1 showed negligible bactericidal activity across the entire concentration range tested, while AMP-3 produced moderate reductions in CFUs that varied between biological replicates, suggesting either partial activity or sensitivity to subtle experimental variables. To investigate killing kinetics, time-course experiments were conducted using a fixed peptide concentration of 8 µM, selected based on intermediate activity in the dose–response assays. Samples were collected at 0, 30, 60, 120, and 240 minutes post-treatment and processed for CFU enumeration as described above. These experiments demonstrated that AMP-2 exerts rapid bactericidal effects, with a marked reduction in CFUs observed within the first 30 minutes of exposure. By contrast, AMP-4 displayed a delayed onset of killing but sustained bactericidal activity over the full 4-hour assay period, suggesting potential differences in mechanism or peptide–membrane interactions. Preliminary mechanistic insight was obtained using a membrane integrity assay based on differential uptake of live/dead fluorescent dyes. Following peptide exposure, cells were stained according to the manufacturer’s protocol and analysed by fluorescence microscopy (or plate reader/flow cytometry, if applicable). Both AMP-2 and AMP-4 treatments resulted in increased uptake of the membrane-impermeant dye relative to controls, indicating compromised membrane integrity. While these findings are consistent with membrane disruption as a mode of action, further experiments—such as membrane depolarisation assays, lipid vesicle leakage studies, or electron microscopy—will be required to definitively establish the underlying killing mechanism."
    },
    {
      "date": "2026-01-12",
      "text": "Completed RNA-seq QC and initial differential expression analysis."
    }
  ]